<!-- add-pr-comment:poc-tfplan -->

Terraform plan output for poc

```text


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.backstage.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
      ~ desired_count                      = 1 -> 2
        id                                 = "arn:aws:ecs:us-east-1:884360309640:service/arc-poc-cluster/arc-poc-cluster-backstage"
        name                               = "arc-poc-cluster-backstage"
        tags                               = {
            "Environment" = "poc"
            "MonoRepo"    = "False"
            "Name"        = "arc-poc-cluster-backstage"
            "Project"     = "arc"
        }
      ~ task_definition                    = "arn:aws:ecs:us-east-1:884360309640:task-definition/arc-poc-cluster-backstage:20" -> (known after apply)
        # (14 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.backstage.aws_ecs_task_definition.this will be created
  + resource "aws_ecs_task_definition" "this" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (sensitive value)
      + cpu                      = "2048"
      + execution_role_arn       = "arn:aws:iam::884360309640:role/backstage-poc-execution"
      + family                   = "arc-poc-cluster-backstage"
      + id                       = (known after apply)
      + memory                   = "4096"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Environment" = "poc"
          + "MonoRepo"    = "False"
          + "Name"        = "arc-poc-cluster-backstage"
          + "Project"     = "arc"
        }
      + tags_all                 = {
          + "Environment" = "poc"
          + "MonoRepo"    = "False"
          + "Name"        = "arc-poc-cluster-backstage"
          + "Project"     = "arc"
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.

```

